# 4) გააკეთეთ ეს ამოცანა:
# იპოვე ლუწი რიცხვები და მიიღე ქულები!
# წესები:
# მოცემულია რიცხვების Tuple (3, 6, 8, 1, 9, 12, 4).
# ლუწი რიცხვი არის ისეთი, რომელიც 2-ზე უნაშთოდ იყოფა.
# ყოველი ლუწი რიცხვის პოვნაზე მიიღებ 1 ქულას.
# დაბეჭდე ლუწი რიცხვები და ბოლოს აჩვენე, რამდენი ქულა დააგროვე.
# ახსენით დავალება კომენტარებით.

# ვქმნით კორტეჟს
my_tuple = (3, 6, 8, 1, 9, 12, 4)

# ვქმნით ცვლადს რომელიც ინახავს ქულებს
even_count = 0

# გადაუვლით for loop-ით კორტეჟს და if პირობის მეშვეობით ვპოულობთ ლუწ რიცხვებს შემდეგ კი როდესაც ლუწი რიცხვი იპრინტება, ქულების ცვლადს ემატება 1
for i in my_tuple:
    if i % 2 == 0:
        print(i)
        even_count += 1

# საბოლოოდ კი ვპრინტავთ ქულების რაოდენობას
print("ქულები: ", even_count)

