# 1) კომენტარის სახით ჩამოთვალე ჩაშენებული ფუნქციები და რას შვება თითეული აღწერე

# print()           ------           პრინტით ჩვენ გამოგვაქვს რაღაცა ეკრანზე (ტერმინალში).
# len()             ------           ლენით ჩვენ ვიგებთ ლისტის / სტრინგის სიგრძეს.
# int()             ------           ეს არის datatype-ის გარდაქმნა, ამით ჩვენ რაიმე ელემენტს გარდავქმნით ინტეჯერათ.
# str()             ------           ეს არის datatype-ის გარდაქმნა, ამით ჩვენ რაიმე ელემენტს გარდავქმნით სტრინგათ.
# bool()            ------           ეს არის datatype-ის გარდაქმნა, ამით ჩვენ რაიმე ელემენტს გარდავქმნით ბულიანათ (True / False).
# float()           ------           ეს არის datatype-ის გარდაქმნა, ამით ჩვენ რაიმე ელემენტს გარდავქმნით ათწილად რიცხვად.
# input()           ------           ინფუთით მომხმარებელს შემოყავს რაიმე ინფორმაცია.
# .append()         ------           ამით ჩვენ შეგვიძლია დავამატოთ რაიმე ელემენტი ლისტში.
# .pop()            ------           ამით ჩვენ შეგვიძლია ამოვიღოთ რაიმე ელემენტი ლისტიდან.
