# 1)
# --ახსენი რისთვის გამოიყენება ინდექსინი, 
# --დაწერე ინდექსინგის  მაგალიათი ანუ შექმენი დიდი სია და გამოიყენე ინდექსინგი და დაპრინე მე 0-ინდექსი 1-ინდექსი 2-ინდექსი 3-ინდექსი 4-ინდექსი და ასევე 5 ჯერ შეუცვალე მნიშვნელობა სიაში არებულ ელემენტებს ინდექსინგის მეშვეობით

# ინდექსინგით ჩვენ შეგვიძლია მივწვდეთ რაიმე ელემენტს სიაში ან სტრინგში

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(numbers[0])
print(numbers[1])
print(numbers[2])
print(numbers[3])
print(numbers[4])

numbers[0] = 15
numbers[1] = 200
numbers[2] = 10
numbers[3] = 111
numbers[4] = 1010

print(numbers[0])
print(numbers[1])
print(numbers[2])
print(numbers[3])
print(numbers[4])