# # 2) მომხმარებელს სთხოვე შეიყვანოს თავისი ასაკი და მიუთითოს, აქვს თუ არა სტუდენტური ბარათი.
# # შემდეგ:
# თუ ასაკი ნაკლებია 18-ზე ან სტუდენტური ბარათი აქვს → დაბეჭდე "დანაზოგი გაქვს!"
# თუ ასაკი 60 ან მეტია და არ აქვს ბარათი → დაბეჭდე "პენსიონერის ფასდაკლება გაქვს!"
# სხვა შემთხვევაში → "ფასდაკლება არ გეკუთვნის."

age = int(input("Please enter your age: "))
student_card = input("You have Student card? (Yes/No): ")

if age < 18 or student_card == "Yes":
    print("დანაზოგი გაქვს!")
elif age >= 60 and student_card == "No":
    print("პენსიონერის ფასდაკლება გაქვს!")
else:
    print("ფასდაკლება არ გეკუთვნის.")

