# 3) მომხმარებელს სთხოვე შეიყვანოს ორი რიცხვი. შემდეგ:
# თუ ორივე რიცხვი დადებითია → დაბეჭდე "ორივე დადებითია"
# თუ მხოლოდ ერთი დადებითია → "მხოლოდ ერთი დადებითი რიცხვია"
# თუ არცერთი არ არის დადებითი → "არცერთი არ არის დადებითი"

num1 = int(input("Please enter any number: "))
num2 = int(input("Please enter any number: "))

if num1 > 0 and num2 > 0:
    print("ორივე დადებითია")
elif num1 > 0 or num2 > 0:
    print("მხოლოდ ერთი დადებითი რიცხვია")
elif num1 < 0 and num2 < 0:
    print("არცერთი არ არის დადებითი")

