# 5) შეამოწმეთ რესურსებში ჩაგდებული სურათი და მის მიხედვით დაწერეთ კომენტარებად ან პრეზენტაციაში მოქმედედების თანმიმდევრობა და საბოლოო პასუხი, ასევე როგორც ნამდვილი პითონის კოდი (შექმენით a,b,c ცვლადები, შექმენით result_0, result_1, result_2 ცვლადები და შეინახეთ თითოეულში შესაბამისი მნიშვნელობა და გამოპრინტეთ).  

# რესურსებში ჩაგდებული გამოსახულება: 
# გამოთვალეთ შემდეგი გამოსახულებების მნიშვნელობები, თუ A - ს მნიშვნელობაა 1, B - ს მნიშვნელობაა 0 და C - ს მნიშვნელობაა 0:
# ა) (A&&!B)||(B&&!A); 
# ბ) (B&&C)&&(A||B); 
# გ) (A&&!C)||(B&&!A)||(B&&!C);

A = 1
B = 0
C = 0

# 1) (A&&!B)||(B&&!A)        ====        (A and not B) or (B and not A)
result_0 = (A and not B) or (B and not A)                        # True
print(result_0)

# 2) (B&&C)&&(A||B)          ====        (B and C) and (A or B)
result_1 = (B and C) and (A or B)                                # False
print(result_1)

# 3) (A&&!C)||(B&&!A)||(B&&!C)          ====         (A and not C) or (B and not A) or (B and not C)
result_2 = (A and not C) or (B and not A) or (B and not C)       # True
print(result_2)