print("მოგესალმებით, ეს არის უნივერსიტეტის მისაღები გამოცდა, იქნება 20 კითხვა, თითო სწორ პასუხზე დაგეწერებათ 5 ქულა, გადამსვლელი ქულების რაოდენობა: 50.")
print("პირველი 10 კითხვა იქნება მათემატიკის შესახებ, დანარჩენი 10 კი ისტორიის შესახებ")

trials = 1

print("მზად ხართ გამოცდის გასავლელათ?")
print('ა) კი')
print('ბ) არა')
answer0 = input("თქვენი პასუხი: ")

while True:
    score = 0

    if answer0 == "კი" or answer0 == "ა":
        print()
    else:
        print("კარგით, რიდესაც მზად იქნებით დაბრუნდით, წარმატებებს გისურვებთ!")
        break

    print("პირველი კითხვა: 10 * 10 = ? პასუხის ვარიანტები ქვემოთ არის.")                         # პირველი კითხვა (1)
    print("ა) 110")
    print("ბ) 120")
    print("გ) 100")
    print("დ) 90")
    answer1= input("თქვენი პასუხი: ")                                                            # სწორი პასუხი: გ) 100

    if answer1 == '100' or answer1 == "გ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: გ) 100")

    print()

    print("მეორე კითხვა: 354 / 18 = ? პასუხის ვარიანტები ქვემოთ არის.")                           # მეორე კითხვა (2)
    print("ა) 19.5")
    print("ბ) 18.4")
    print("გ) 20.1")
    print("დ) 19.6")
    answer2 = input("თქვენი პასუხი: ")                                                            # სწორი პასუხი: დ) 19.6

    if answer2 == '19.6' or answer2 == "დ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: დ) 19.6")

    print()

    print("მესამე კითხვა: 29 * 12 = ? პასუხის ვარიანტები ქვემოთ არის.")                            # მესამე კითხვა (3)
    print("ა) 348")
    print("ბ) 350")
    print("გ) 345")
    print("დ) 329")
    answer3 = input("თქვენი პასუხი: ")                                                            # სწორი პასუხი: ა) 348

    if answer3 == "348" or answer3 == "ა":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: ა) 348")

    print()

    print("მეოთხე კითხვა: 348 * 12 = ? პასუხის ვარიანტები ქვემოთ არის.")                          # მეოთხე კითხვა (4)
    print("ა) 4170")
    print("ბ) 4176")
    print("გ) 4180")
    print("დ) 4169")
    answer4 = input("თქვენი პასუხი: ")                                                             # სწორი პასუხი: ბ) 4176

    if answer4 == "4176" or answer4 == "ბ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: ბ) 4176")

    print()

    print("მეხუთე კითხვა: 5763 / 12 = ? პასუხის ვარიანტები ქვემოთ არის.")                         # მეხუთე კითხვა (5)
    print("ა) 476")
    print("ბ) 482")
    print("გ) 479")
    print("დ) 480")
    answer5 = input("თქვენი პასუხი: ")                                                             # სწორი პასუხი: დ) 480

    if answer5 == "480" or answer5 == "დ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: დ) 480")

    print()

    print("მეექვსე კითხვა: 327 * 7 = ? პასუხის ვარიანტები ქვემოთ არის.")                            # მეექვსე კითხვა (6)
    print("ა) 2289")
    print("ბ) 2267")
    print("გ) 2278")
    print("დ) 2288")
    answer6 = input("თქვენი პასუხი: ")                                                              # სწორი პასუხი: ა) 2289

    if answer6 == "2289" or answer6 == "ა":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print('სწორი პასუხი იყო: ა) 2289')

    print()

    print("მეშვიდე კითხვა: 32432 - 16728 = ? პასუხის ვარიანტები ქვემოთ არის.")                      # მეშვიდე კითხვა (7)
    print("ა) 15700")
    print("ბ) 15704")
    print("გ) 15722")
    print("დ) 15702")
    answer7 = input("თქვენი პასუხი: ")                                                              # სწორი პასუხი: ბ) 15704

    if answer7 == "15704" or answer7 == "ბ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: ბ) 15704")

    print()

    print("მერვე კითხვა: 20174 + 9065 = ? პასუხის ვარიანტები ქვემოთ არის.")                          # მერვე კითხვა (8)
    print("ა) 29200")
    print("ბ) 29229")
    print("გ) 29239")
    print("დ) 29203")
    answer8 = input("თქვენი პასუხი: ")                                                               # სწორი პასუხი: გ) 29239

    if answer8 == "29239" or answer8 == "გ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: გ) 29239")

    print()

    print("მეცხრე კითხვა: 9 * 9 = ? პასუხის ვარიანტები ქვემოთ არის.")                                # მეცხრე კითხვა (9)
    print('ა) 79')
    print('ბ) 85')
    print('გ) 82')
    print("დ) 81")
    answer9 = input("თქვენი პასუხი: ")                                                                # სწორი პასუხი: დ) 81

    if answer9 == "81" or answer9 == "დ":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: დ) 81")
 
    print()

    print("მეათე კითხვა: 60 * 24 = ? პასუხის ვარიანტები ქვემოთ არის.")                               # მეათე კითხვა (10)
    print("ა) 1440")
    print("ბ) 1430")
    print("გ) 1450")
    print("დ) 1420")
    answer10 = input("თქვენი პასუხი: ")                                                               # სწორი პასუხი: ა) 1440

    if answer10 == "1440" or answer10 == "ა":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("თქვენი პასუხი სამწუხაროთ არასწორია.")
        print("სწორი პასუხი იყო: ა) 1440")

    print()

    print("დამთავრდა მათემატიკის კითხვები, იწყება ისტორიის კითხვები.")

    
                         #კითხვა N1
    print()
    print("1. რომელ წელს გამოცხადდა საქართველოს პირველი რესპუბლიკა?")
    print("ა) 1801")
    print("ბ) 1918")
    print("გ) 1991")
    print("დ) 1921")
    answer11 = input("პასუხი: ")
    if answer11 == "ბ" or answer11 == "1918":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ბ")
                         #კითხვა N2
    print()
    print("2. ვინ იყო თამარ მეფის მამა?")
    print("ა) ვახტანგ გორგასალი")
    print("ბ) დავით აღმაშენებელი")
    print("გ) გიორგი III")
    print("დ) ბაგრატ III")
    answer12 = input("პასუხი: ")
    if answer12 == "გ" or answer12 == "გიორგი III":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია გ")
                         #კითხვა N3
    print()
    print("3. რომელ წელს გაიმართა დიდგორის ბრძოლა?")
    print("ა) 1121")
    print("ბ) 1221")
    print("გ) 1101")
    print("დ) 1184")
    answer13 = input("პასუხი: ")
    if answer13 == "ა" or answer13 =="1121":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ა")
                         #კითხვა N4
    print()
    print("4. ვინ დაწერა 'ვეფხისტყაოსანი'?")
    print("ა) ილია ჭავჭავაძე")
    print("ბ) შოთა რუსთაველი")
    print("გ) აკაკი წერეთელი")
    print("დ) გალაკტიონ ტაბიძე")
    answer14 = input("პასუხი: ")
    if answer14 == "ბ" or answer14 == "შოთა რუსთაველი":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ბ")
                         #კითხვა N5
    print()
    print("5. რომელ რეგიონში მდებარეობს უფლისციხე?")
    print("ა) კახეთი")
    print("ბ) სამცხე-ჯავახეთი")
    print("გ) შიდა ქართლი")
    print("დ) იმერეთი")
    answer15 = input("პასუხი: ")
    if answer15 == "გ" or answer15 == "შიდა ქართლი":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია გ")
                         #კითხვა N6
    print()
    print("6. რომელ წელს შეუერთდა საქართველო რუსეთის იმპერიას?")
    print("ა) 1801")
    print("ბ) 1918")
    print("გ) 1921")
    print("დ) 1765")
    answer16 = input("პასუხი: ")
    if answer16 == "ა" or answer16 == "1801":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ა")
                         #კითხვა N7
    print()
    print("7. სად არის ბაგრატის ტაძარი?")
    print("ა) თბილისი")
    print("ბ) ქუთაისი")
    print("გ) ბათუმი")
    print("დ) გორი")
    answer17 = input("პასუხი: ")
    if answer17 == "ბ" or answer17 =="ქუთაისი":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ბ")
                         #კითხვა N8
    print()
    print("8. ვინ იყო პირველი ქართველი მეფე გაერთიანებულ საქართველოში?")
    print("ა) ბაგრატ III")
    print("ბ) გიორგი I")
    print("გ) დავით IV")
    print("დ) არჩილ II")
    answer18 = input("პასუხი: ")
    if answer18 == "ა" or answer18 == "ბაგრატ III":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ა")
                         #კითხვა N9
    print() 
    print("9. რომელ წელს დაიბადა ილია ჭავჭავაძე?")
    print("ა) 1837")
    print("ბ) 1845")
    print("გ) 1851")
    print("დ) 1820")
    answer19 = input("პასუხი: ")
    if answer19 == "ა" or answer19 == "1837":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ა")
                         #კითხვა N10
    print()
    print("10. რომელ საუკუნეში მოღვაწეობდა დავით აღმაშენებელი?")
    print("ა) XI-XII")
    print("ბ) XIII")
    print("გ) IX")
    print("დ) XIV")
    answer20 = input("პასუხი: ")
    if answer20 == "ა" or answer20 == " XI-XII":
        print("თქვენ გაეცით სწორი პასუხი! თქვენ დაგერიცხათ 5 ქულა.")
        score += 5
    else:
        print("არასწორია! სწორი პასუხია ა")

    print()
    print("მისაღები გამოცდა დასრულებულია.")

    if score >= 90:
        print()
        print(f"თქვენი ქულების რაოდენობა: {score}")
        print("გილოცავთ, თქვენ წარმატებით გაიარეთ გამოცდა და თქვენი ქულებიდან გამომდინარე თქვენ მიიღეთ 50%-იანი გრანტი!!!")
        break
    elif score >= 70:
        print()
        print(f"თქვენი ქულების რაოდენობა: {score}")
        print("გილოცავთ, თქვენ წარმატებით გაიარეთ გამოცდა და თქვენი ქულებიდან გამომდინარე თქვენ მიიღეთ 30%-იანი გრანტი!!!")
        break
    elif score >= 50:
        print()
        print(f"თქვენი ქულების რაოდენობა: {score}")
        print("გილოცავთ, თქვენ წარმატებით გაიარეთ გამოცდა")
        break
    else:
        print()
        print(f"თქვენი ქულების რაოდენობა: {score}")
        print("სამწუხაროდ თქვენ ვერ გაიარეთ გამოცდა, გთხოვთ სცადეთ თავიდან.")

        print()

        print("გსურთ, რომ თავიდან სცადოთ გამოცდის ჩაბარება?")
        print(f"ცდების რაოდენობა: {trials}")
        print("ა) კი")
        print("ბ) არა")
        answer00 = input("თქვენი პასუხი: ")

        if answer00 == "კი" or answer00 == "ა":
            pass
        else:
            print("კარგით, ჩვენ მაინც წარმატებებს გისურვებთ!")
            break
        trials -= 1
    
    if trials == -1:
        print()
        print("სამწუხაროთ თქვენ დაგიმთავრდათ ცდები.")
        print("არ მოიწტინოთ, ჩვენ ყოველ წელს გვიტარდება ასეთი გამოცდა!")
        break
    else:
        pass
