# დავალება 1: წნევის ანალიზი
# მომხმარებელი შეიყვანს ორ მაჩვენებელს: სისტოლური და დიასტოლური წნევა.
# პროგრამამ უნდა განსაზღვროს წნევის კატეგორია:

# თუ სისტოლური > 140 ან დიასტოლური > 90 → "მაღალი წნევა"

# თუ სისტოლური < 90 ან დიასტოლური < 60 → "დაბალი წნევა"

# სხვა შემთხვევაში → "წნევა ნორმალურია"

systolic_pressure = int(input("გთხოვთ შეიყვანოთ სისტოლური წნევა: "))
Diastolic_pressure = int(input("გთხოვთ შეიყვანოთ დიასტოლური წნევა: "))

if systolic_pressure > 140 or Diastolic_pressure > 90:
    print("მაღალი წნევაა")
elif systolic_pressure < 90 or Diastolic_pressure < 60:
    print("დაბალი წნევა")
else:
    print("წნევა ნორმალურია")

