# დავალება 2: წონის შეფასება ასაკის მიხედვით (უბრალოდ და ლოგიკურად)
#  აღწერა:
# მომხმარებელი შეიყვანს საკუთარ ასაკს და წონას.
# პროგრამამ უნდა შეაფასოს წონა ასაკის მიხედვით მარტივი ლოგიკით:

# თუ ასაკი < 10:

# წონა < 20 → "წონა დაბალია"

# წონა 20-40 → "წონა ნორმალურია"

# წონა > 40 → "წონა მაღალია"

# თუ ასაკი 10-17:

# წონა < 40 → "წონა დაბალია"

# წონა 40-65 → "წონა ნორმალურია"

# წონა > 65 → "წონა მაღალია"

# თუ ასაკი 18 ან მეტი:

# წონა < 50 → "წონა დაბალია"

# წონა 50-90 → "წონა ნორმალურია"

# წონა > 90 → "წონა მაღალია"

age = int(input("გთხოვთ შეიყვანოთ თქვენი ასაკი: "))
weight = int(input("გთხოვთ შეიყვანოთ თქვენი წონა: "))

if age < 10 and weight < 20:
    print("წონა დაბალია.")
elif age < 10 and weight <= 40:
    print("წონა ნორმალურია.")
elif age < 10 and weight > 40:
    print("წონა მაღალია.")
elif age <= 17 and weight < 40:
    print("წონა დაბალია.")
elif age <= 17 and weight <= 65:
    print("წონა ნორმალურია.")
elif age <= 17 and weight > 65:
    print("წონა მაღალია.")
elif age >= 18 and weight < 50:
    print("წონა დაბალია.")
elif age >= 18 and weight <= 90:
    print("წონა ნორმალურია.")
elif age >= 18 and weight > 90:
    print("წონა მაღალია.")