# დავალება 3: ასაკის შეჯერება დღის მონაკვეთთან
# შეიყვანოს მომხმარებელმა ასაკი და საათი (0-დან 23-მდე). პროგრამამ განსაზღვროს:

# თუ ასაკი < 18 და დრო ≥ 22 → "დროა დაძინების"

# თუ ასაკი ≥ 60 და დრო ≥ 21 → "დასვენება რეკომენდებულია"

# სხვა შემთხვევაში → "შეგიძლიათ გააგრძელოთ აქტივობა"

age = int(input("გთხოვთ შეიყვანოთ თქვენი ასაკი: "))
time = int(input("გთხოვთ შეიყვანოთ დრო. (0-დან 23-მდე): "))

if time > 23:
    print("თქვენ შეიყვანეთ არასწორი დრო.")
elif age < 18 and time >= 22:
    print("დაძინების დროა.")
elif age >= 60 and time >= 21:
    print("დასვენება რეკომენდირებულია.")
else:
    print("შეგიძლიათ გააგრძელოთ აქტივობა.")
